# IsPlaceholder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheet..::..IsPlaceholder Property
ViewSheet Class See Also
---
Identifies whether or not the view sheet represents a placeholder sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsPlaceholder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPlaceholder As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPlaceholder {
	bool get ();
}
```

# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace